martiinezz/BMWI3BMS-ESP32/src/main.cpp
  }
}

void SOCcharged(int y)
{
  if (y == 1)
  {
    SOC = 95;
    ampsecond = (settings.CAP * settings.Pstrings * 1000) / 0.27777777777778 ; //reset to full, dependant on given capacity. Need to improve with auto correction for capcity.
  }
  if (y == 2)
  {
    SOC = 100;
    ampsecond = (settings.CAP * settings.Pstrings * 1000) / 0.27777777777778 ; //reset to full, dependant on given capacity. Need to improve with auto correction for capcity.
  }
}

void Prechargecon()
{
  if (digitalRead(IN1) == HIGH || digitalRead(IN3) == HIGH) //detect Key ON or AC present
  {
    digitalWrite(OUT4, HIGH);//Negative Contactor Close
    contctrl = 2;
    if (Pretimer +  settings.Pretime > millis() || currentact > settings.Precurrent)
    {
      digitalWrite(OUT2, HIGH);//precharge
    }
    else //close main contactor
    {
      digitalWrite(OUT1, HIGH);//Positive Contactor Close
      contctrl = 3;
      if (settings.ChargerDirect == 1)
      {
        bmsstatus = Drive;
      }
      else
      {
        if (digitalRead(IN3) == HIGH)
        {
          bmsstatus = Charge;
        }
        if (digitalRead(IN1) == HIGH)
        {
          bmsstatus = Drive;
        }
      }
      digitalWrite(OUT2, LOW);
    }
  }
  else
  {
    digitalWrite(OUT1, LOW);
    digitalWrite(OUT2, LOW);
    digitalWrite(OUT4, LOW);
    bmsstatus = Ready;
    contctrl = 0;
  }
}

void contcon()
{
  if (contctrl != contstat) //check for contactor request change
  {
    if ((contctrl & 1) == 0)
    {
      ledcWrite(OUT5, 0);
      contstat = contstat & 254;
    }
    if ((contctrl & 2) == 0)
    {
      ledcWrite(OUT6, 0);
      contstat = contstat & 253;
    }
    if ((contctrl & 4) == 0)
    {
      ledcWrite(OUT7, 0);
      contstat = contstat & 251;
    }


    if ((contctrl & 1) == 1)
    {
      if ((contstat & 1) != 1)
      {
        if (conttimer1 == 0)
        {
          ledcWrite(OUT5, 255);
          conttimer1 = millis() + pulltime ;
        }
        if (conttimer1 < millis())
        {
          ledcWrite(OUT5, settings.conthold);
          contstat = contstat | 1;
          conttimer1 = 0;
        }
      }
    }

    if ((contctrl & 2) == 2)
    {
      if ((contstat & 2) != 2)
      {
        if (conttimer2 == 0)
        {
          Serial.println();
          Serial.println("pull in OUT6");
          ledcWrite(OUT6, 255);
          conttimer2 = millis() + pulltime ;
        }
        if (conttimer2 < millis())
        {
          ledcWrite(OUT6, settings.conthold);
          contstat = contstat | 2;
          conttimer2 = 0;
        }
      }
    }
    if ((contctrl & 4) == 4)
    {
      if ((contstat & 4) != 4)
      {
        if (conttimer3 == 0)
        {
          Serial.println();
          Serial.println("pull in OUT7");
          ledcWrite(OUT7, 255);
          conttimer3 = millis() + pulltime ;
        }
        if (conttimer3 < millis())
        {
          ledcWrite(OUT7, settings.conthold);
          contstat = contstat | 4;
          conttimer3 = 0;
        }
      }
    }
    /*
       SERIALCONSOLE.print(conttimer);
       SERIALCONSOLE.print("  ");
       SERIALCONSOLE.print(contctrl);
       SERIALCONSOLE.print("  ");
       SERIALCONSOLE.print(contstat);
       SERIALCONSOLE.println("  ");
    */

  }
  if (contctrl == 0)
  {
    ledcWrite(OUT5, 0);
    ledcWrite(OUT6, 0);
  }
}

void calcur()
{
  sensor = 1;
  x = 0;
  SERIALCONSOLE.print(" Calibrating Current Offset ::::: ");
  while (x < 20)
  {
    settings.offset1 = settings.offset1 + (analogRead(ACUR1) * 3300 / ADC_MAX_VAL);
    SERIALCONSOLE.print(".");
    delay(100);
    x++;
  }
  settings.offset1 = settings.offset1 / 21;
  SERIALCONSOLE.print(settings.offset1);
  SERIALCONSOLE.print(" current offset 1 calibrated ");
  SERIALCONSOLE.println("  ");
  x = 0;
  sensor = 2;
  SERIALCONSOLE.print(" Calibrating Current Offset ::::: ");
  while (x < 20)
  {
    settings.offset2 = settings.offset2 + (analogRead(ACUR2) * 3300 / ADC_MAX_VAL);
    SERIALCONSOLE.print(".");
    delay(100);
    x++;
  }
  settings.offset2 = settings.offset2 / 21;
  SERIALCONSOLE.print(settings.offset2);
  SERIALCONSOLE.print(" current offset 2 calibrated ");
  SERIALCONSOLE.println("  ");
}

void VEcan() //communication with Victron system over CAN
{
  if (settings.chargertype == 6)
  {
    msg.id  = 0x618;
    msg.len = 8;
    msg.buf[0] = 0x00;
    msg.buf[1] = 'B';
    msg.buf[2] = 'Y';
    msg.buf[3] = 'D';
    msg.buf[4] = 0x00;
    msg.buf[5] = 0x00;
    msg.buf[6] = 0x00;
    msg.buf[7] = 0x00;
    
    ESPsendCAN(msg);
  
    delay(2);
    msg.id  = 0x5D8;
    msg.len = 8;
    msg.buf[0] = 0x00;
    msg.buf[1] = 'B';
    msg.buf[2] = 'Y';
    msg.buf[3] = 'D';
    msg.buf[4] = 0x00;
    msg.buf[5] = 0x00;
    msg.buf[6] = 0x00;
    msg.buf[7] = 0x00;
    ESPsendCAN(msg);
    

    delay(2);

    msg.id  = 0x558;
    msg.len = 8;
    msg.buf[0] = 0x03;
    msg.buf[1] = 0x12;
    msg.buf[2] = 0x00;
    msg.buf[3] = 0x04;
    msg.buf[4] = highByte(settings.CAP * settings.Pstrings * 37 * settings.Scells);
    msg.buf[5] = lowByte(settings.CAP * settings.Pstrings * 37 * settings.Scells);
    msg.buf[6] = 0x05;
    msg.buf[7] = 0x07;
    ESPsendCAN(msg);
    

    delay(2);

    msg.id  = 0x598;
    msg.len = 8;
    msg.buf[0] = 0x00;
    msg.buf[1] = 0x00;
    msg.buf[2] = 0x12;
    msg.buf[3] = 0x34;
    msg.buf[4] = 0x00;
    msg.buf[5] = 0x00;
    msg.buf[6] = 0x04;
    msg.buf[7] = 0x4F;
    ESPsendCAN(msg);
    

    delay(2);

    msg.id  = 0x358;
    msg.len = 8;
    if (storagemode == 0)
    {
      msg.buf[0] = highByte(uint16_t((settings.ChargeVsetpoint * settings.Scells ) * 10));
      msg.buf[1] = lowByte(uint16_t((settings.ChargeVsetpoint * settings.Scells ) * 10));
    }
    else
    {
      msg.buf[0] = highByte(uint16_t((settings.StoreVsetpoint * settings.Scells ) * 10));
      msg.buf[1] = lowByte(uint16_t((settings.StoreVsetpoint * settings.Scells ) * 10));

    }
    msg.buf[2] = highByte(uint16_t((settings.DischVsetpoint * settings.Scells) * 10));
    msg.buf[3] = lowByte(uint16_t((settings.DischVsetpoint * settings.Scells) * 10));
    msg.buf[4] = highByte(discurrent );
    msg.buf[5] = lowByte(discurrent);
    msg.buf[6] = highByte(chargecurrent);
    msg.buf[7] = lowByte(chargecurrent);
    ESPsendCAN(msg);


    delay(2);

    msg.id  = 0x3D8;
    msg.len = 8;
    msg.buf[0] = highByte(SOC * 100);
    msg.buf[1] = lowByte(SOC * 100);
    msg.buf[2] = highByte(SOH);
    msg.buf[3] = lowByte(SOH);
    msg.buf[4] = highByte(uint16_t(ampsecond * 0.002777778));
    msg.buf[5] = lowByte(uint16_t(ampsecond * 0.002777778));
    msg.buf[6] = 0xF9;
    msg.buf[7] = 0;
    ESPsendCAN(msg);
    

    delay(2);

    msg.id  = 0x458;
    msg.len = 8;
    msg.buf[0] = 0x00;
    msg.buf[1] = 0x00;
    msg.buf[2] = 0x12;
    msg.buf[3] = 0x34;
    msg.buf[4] = 0x00;
    msg.buf[5] = 0x00;
    msg.buf[6] = 0x56;
    msg.buf[7] = 0x78;
    ESPsendCAN(msg);
    

    delay(2);

    msg.id  = 0x518;
    msg.len = 8;
    msg.buf[0] = highByte(uint16_t(bms.getHighTemperature() * 10));
    msg.buf[1] = lowByte(uint16_t(bms.getHighTemperature() * 10));
    msg.buf[2] = highByte(uint16_t(bms.getLowTemperature() * 10));
    msg.buf[3] = lowByte(uint16_t(bms.getLowTemperature() * 10));
    msg.buf[4] = 0xFF;
    msg.buf[5] = 0xFF;
    msg.buf[6] = 0xFF;
    msg.buf[7] = 0xFF;
    ESPsendCAN(msg);
    

    delay(2);

