martiinezz/BMWI3BMS-ESP32/src/main.cpp
    msg.id  = 0x4D8;
    msg.len = 8;
    msg.buf[0] = highByte(uint16_t(bms.getPackVoltage() * 10));
    msg.buf[1] = lowByte(uint16_t(bms.getPackVoltage() * 10));
    msg.buf[2] = highByte(long(currentact / 100));
    msg.buf[3] = lowByte(long(currentact / 100));
    msg.buf[4] = highByte(int16_t(bms.getAvgTemperature() * 10));
    msg.buf[5] = lowByte(int16_t(bms.getAvgTemperature() * 10));
    msg.buf[6] = 0x03;
    msg.buf[7] = 0x08;
    ESPsendCAN(msg);
    

    delay(2);
    msg.id  = 0x158;
    msg.len = 8;
    msg.buf[0] = alarmm[0];//High temp  Low Voltage | High Voltage
    msg.buf[1] = alarmm[1]; // High Discharge Current | Low Temperature
    msg.buf[2] = alarmm[2]; //Internal Failure | High Charge current
    msg.buf[3] = alarmm[3];// Cell Imbalance
    msg.buf[4] = warning[0];//High temp  Low Voltage | High Voltage
    msg.buf[5] = warning[1];// High Discharge Current | Low Temperature
    msg.buf[6] = warning[2];//Internal Failure | High Charge current
    msg.buf[7] = warning[3];// Cell Imbalance
    ESPsendCAN(msg);
    

  }
  else
  {
    msg.id  = 0x351;
    msg.len = 8;
    if (storagemode == 0)
    {
      msg.buf[0] = lowByte(uint16_t((settings.ChargeVsetpoint * settings.Scells ) * 10));
      msg.buf[1] = highByte(uint16_t((settings.ChargeVsetpoint * settings.Scells ) * 10));
    }
    else
    {
      msg.buf[0] = lowByte(uint16_t((settings.StoreVsetpoint * settings.Scells ) * 10));
      msg.buf[1] = highByte(uint16_t((settings.StoreVsetpoint * settings.Scells ) * 10));
    }
    msg.buf[2] = lowByte(chargecurrent);
    msg.buf[3] = highByte(chargecurrent);
    msg.buf[4] = lowByte(discurrent );
    msg.buf[5] = highByte(discurrent);
    msg.buf[6] = lowByte(uint16_t((settings.DischVsetpoint * settings.Scells) * 10));
    msg.buf[7] = highByte(uint16_t((settings.DischVsetpoint * settings.Scells) * 10));
    ESPsendCAN(msg);
    

    msg.id  = 0x355;
    msg.len = 8;
    msg.buf[0] = lowByte(SOC);
    msg.buf[1] = highByte(SOC);
    msg.buf[2] = lowByte(SOH);
    msg.buf[3] = highByte(SOH);
    msg.buf[4] = lowByte(SOC * 10);
    msg.buf[5] = highByte(SOC * 10);
    msg.buf[6] = 0;
    msg.buf[7] = 0;
    ESPsendCAN(msg);
    

    msg.id  = 0x356;
    msg.len = 8;
    msg.buf[0] = lowByte(uint16_t(bms.getPackVoltage() * 100));
    msg.buf[1] = highByte(uint16_t(bms.getPackVoltage() * 100));
    msg.buf[2] = lowByte(long(currentact / 100));
    msg.buf[3] = highByte(long(currentact / 100));
    msg.buf[4] = lowByte(int16_t(bms.getAvgTemperature() * 10));
    msg.buf[5] = highByte(int16_t(bms.getAvgTemperature() * 10));
    msg.buf[6] = 0;
    msg.buf[7] = 0;
    ESPsendCAN(msg);
    

    delay(2);
    msg.id  = 0x35A;
    msg.len = 8;
    msg.buf[0] = alarmm[0];//High temp  Low Voltage | High Voltage
    msg.buf[1] = alarmm[1]; // High Discharge Current | Low Temperature
    msg.buf[2] = alarmm[2]; //Internal Failure | High Charge current
    msg.buf[3] = alarmm[3];// Cell Imbalance
    msg.buf[4] = warning[0];//High temp  Low Voltage | High Voltage
    msg.buf[5] = warning[1];// High Discharge Current | Low Temperature
    msg.buf[6] = warning[2];//Internal Failure | High Charge current
    msg.buf[7] = warning[3];// Cell Imbalance
    ESPsendCAN(msg);
    

    msg.id  = 0x35E;
    msg.len = 8;
    msg.buf[0] = bmsname[0];
    msg.buf[1] = bmsname[1];
    msg.buf[2] = bmsname[2];
    msg.buf[3] = bmsname[3];
    msg.buf[4] = bmsname[4];
    msg.buf[5] = bmsname[5];
    msg.buf[6] = bmsname[6];
    msg.buf[7] = bmsname[7];
    ESPsendCAN(msg);
    

    delay(2);
    msg.id  = 0x370;
    msg.len = 8;
    msg.buf[0] = bmsmanu[0];
    msg.buf[1] = bmsmanu[1];
    msg.buf[2] = bmsmanu[2];
    msg.buf[3] = bmsmanu[3];
    msg.buf[4] = bmsmanu[4];
    msg.buf[5] = bmsmanu[5];
    msg.buf[6] = bmsmanu[6];
    msg.buf[7] = bmsmanu[7];
    ESPsendCAN(msg);
    

    if (balancecells == 1)
    {
      if (bms.getLowCellVolt() + settings.balanceHyst < bms.getHighCellVolt())
      {
        msg.id  = 0x3c3;
        msg.len = 8;
        if (bms.getLowCellVolt() < settings.balanceVoltage)
        {
          msg.buf[0] = highByte(uint16_t(settings.balanceVoltage * 1000));
          msg.buf[1] = lowByte(uint16_t(settings.balanceVoltage * 1000));
        }
        else
        {
          msg.buf[0] = highByte(uint16_t(bms.getLowCellVolt() * 1000));
          msg.buf[1] = lowByte(uint16_t(bms.getLowCellVolt() * 1000));
        }
        msg.buf[2] =  0x01;
        msg.buf[3] =  0x04;
        msg.buf[4] =  0x03;
        msg.buf[5] =  0x00;
        msg.buf[6] =  0x00;
        msg.buf[7] = 0x00;
        ESPsendCAN(msg);
        
      }
    }

    delay(2);
    msg.id  = 0x373;
    msg.len = 8;
    msg.buf[0] = lowByte(uint16_t(bms.getLowCellVolt() * 1000));
    msg.buf[1] = highByte(uint16_t(bms.getLowCellVolt() * 1000));
    msg.buf[2] = lowByte(uint16_t(bms.getHighCellVolt() * 1000));
    msg.buf[3] = highByte(uint16_t(bms.getHighCellVolt() * 1000));
    msg.buf[4] = lowByte(uint16_t(bms.getLowTemperature() + 273.15));
    msg.buf[5] = highByte(uint16_t(bms.getLowTemperature() + 273.15));
    msg.buf[6] = lowByte(uint16_t(bms.getHighTemperature() + 273.15));
    msg.buf[7] = highByte(uint16_t(bms.getHighTemperature() + 273.15));
    ESPsendCAN(msg);
    

    delay(2);
    msg.id  = 0x379; //Installed capacity
    msg.len = 2;
    msg.buf[0] = lowByte(uint16_t(settings.Pstrings * settings.CAP));
    msg.buf[1] = highByte(uint16_t(settings.Pstrings * settings.CAP));
    /*
        delay(2);
      msg.id  = 0x378; //Installed capacity
      msg.len = 2;
      //energy in 100wh/unit
      msg.buf[0] =
      msg.buf[1] =
      msg.buf[2] =
      msg.buf[3] =
      //energy out 100wh/unit
      msg.buf[4] =
      msg.buf[5] =
      msg.buf[6] =
      msg.buf[7] =
    */
    delay(2);
    msg.id  = 0x372;
    msg.len = 8;
    msg.buf[0] = lowByte(bms.getNumModules());
    msg.buf[1] = highByte(bms.getNumModules());
    msg.buf[2] = 0x00;
    msg.buf[3] = 0x00;
    msg.buf[4] = 0x00;
    msg.buf[5] = 0x00;
    msg.buf[6] = 0x00;
    msg.buf[7] = 0x00;
    ESPsendCAN(msg);
    

