martiinezz/BMWI3BMS-ESP32/src/main.cpp
        SERIALCONSOLE.print("x - CSC Variant Used: ");
        if ( settings.CSCvariant == BmwI3)
        {
          SERIALCONSOLE.print("Bmw I3");
        }
        if ( settings.CSCvariant == MiniE)
        {
          SERIALCONSOLE.print("Mini-E");
        }

        SERIALCONSOLE.println("  ");



        SERIALCONSOLE.println();
        menuload = 3;
        break;

      default:
        // if nothing else matches, do the default
        // default is optional
        break;
    }
  }

  if (incomingByte == 115 && menuload == 0)
  {
    SERIALCONSOLE.println();
    SERIALCONSOLE.println("MENU");
    SERIALCONSOLE.println("Debugging Paused");
    SERIALCONSOLE.print("Firmware Version : ");
    SERIALCONSOLE.println(firmver);
    SERIALCONSOLE.println("b - Battery Settings");
    SERIALCONSOLE.println("a - Alarm and Warning Settings");
    SERIALCONSOLE.println("e - Charging Settings");
    SERIALCONSOLE.println("c - Current Sensor Calibration");
    SERIALCONSOLE.println("k - Contactor and Gauge Settings");
    SERIALCONSOLE.println("i - Ignore Value Settings");
    SERIALCONSOLE.println("d - Debug Settings");
    SERIALCONSOLE.println("R - Restart BMS");
    SERIALCONSOLE.println("q - exit menu");
    debug = 0;
    menuload = 1;
  }
}

void canread()
{
    CAN_FRAME can_in;

    if (!CAN0.read(can_in))
    {
        SERIALCONSOLE.println("Error during read CAN frame.");
    }

    inMsg = {};
    inMsg.id = can_in.id;
    inMsg.len = can_in.length;
    inMsg.flags.extended = can_in.extended;
    for (int i = 0; i < can_in.length; ++i)
    {
        inMsg.buf[i] = can_in.data.uint8[i];
    }

  // Can0.read(inMsg);
  // Read data: len = data length, buf = data byte(s)

  if ( settings.cursens == Canbus)
  {
    if (settings.curcan == 1)
    {
      switch (inMsg.id)
      {
        case 0x3c0:
          CAB300();
          break;

        case 0x3c1:
          CAB300();
          break;

        case 0x3c2:
          CAB300();
          break;

        default:
          break;
      }
    }
    if (settings.curcan == 2)
    {
      switch (inMsg.id)
      {
        case 0x3c0:
          CAB500();
          break;

        case 0x3c1:
          CAB500();
          break;

        case 0x3c2:
          CAB500();
          break;

        default:
          break;
      }
    }
    if (settings.curcan == 3)
    {
      switch (inMsg.id)
      {
        case 0x521: //
          CANmilliamps = rxBuf[5] + (rxBuf[4] << 8) + (rxBuf[3] << 16) + (rxBuf[2] << 24);
          if (settings.cursens == Canbus)
          {
            RawCur = CANmilliamps;
            getcurrent();
          }
          break;
        case 0x522: //
          voltage1 = rxBuf[5] + (rxBuf[4] << 8) + (rxBuf[3] << 16) + (rxBuf[2] << 24);
          break;
        case 0x523: //
          voltage2 = rxBuf[5] + (rxBuf[4] << 8) + (rxBuf[3] << 16) + (rxBuf[2] << 24);
          break;
        default:
          break;
      }
    }
    if (settings.curcan == 4)
    {
      if (pgnFromCANId(inMsg.id) == 0x1F214 && inMsg.buf[0] == 0) // Check PGN and only use the first packet of each sequence
      {
        handleVictronLynx();
      }
    }
  }

  if (inMsg.id > 0x99 && inMsg.id < 0x160)//do VW BMS magic if ids are ones identified to be modules
  {
    if (candebug == 1 && debug == 1)
    {
      bms.decodecan(inMsg, 1); //do VW BMS if ids are ones identified to be modules
    }
    else
    {
      bms.decodecan(inMsg, 0); //do VW BMS if ids are ones identified to be modules
    }
  }
  if ((inMsg.id & 0xFF0) == 0x170)    // Determine if ID is standard (11 bits) or extended (29 bits)
  {
    if (candebug == 1 && debug == 1)
    {
      bms.decodetemp(inMsg, 1 , settings.CSCvariant);
    }
    else
    {
      bms.decodetemp(inMsg, 0, settings.CSCvariant);
    }
  }
  if (debug == 1)
  {
    if (candebug == 1)
    {
      Serial.print(millis());
      if ((inMsg.id & 0x80000000) == 0x80000000)    // Determine if ID is standard (11 bits) or extended (29 bits)
        sprintf(msgString, "Extended ID: 0x%.8lX  DLC: %1d  Data:", (inMsg.id & 0x1FFFFFFF), inMsg.len);
      else
        sprintf(msgString, ",0x%.3lX,false,%1d", inMsg.id, inMsg.len);

      Serial.print(msgString);

      if ((inMsg.id & 0x40000000) == 0x40000000) {  // Determine if message is a remote request frame.
        sprintf(msgString, " REMOTE REQUEST FRAME");
        Serial.print(msgString);
      } else {
        for (byte i = 0; i < inMsg.len; i++) {
          sprintf(msgString, ", 0x%.2X", inMsg.buf[i]);
          Serial.print(msgString);
        }
      }

      Serial.println();
    }
  }
}

int pgnFromCANId(int canId)
{
  if ((canId & 0x10000000) == 0x10000000)
  {
    return (canId & 0x03FFFF00) >> 8;
  }
  else
  {
    return canId; // not sure if this is really right?
  }
}

void CAB300()
{
  for (int i = 0; i < 4; i++)//4 byte current encoded in 0 1 2 3
  {
    inbox = (inbox << 8) | inMsg.buf[i];
  }
  CANmilliamps = inbox;
  if (CANmilliamps > 0x80000000)
  {
    CANmilliamps -= 0x80000000;
  }
  else
  {
    CANmilliamps = (0x80000000 - CANmilliamps) * -1;
  }
  if (settings.cursens == Canbus)
  {
    RawCur = CANmilliamps;
    getcurrent();
  }
  if (candebug == 1 && debug == 1)
  {
    Serial.println();
    Serial.print(CANmilliamps);
    Serial.print("mA ");
  }
}

void CAB500()//3 byte current encoded in 1 2 3
{
  inbox = 0;
  for (int i = 1; i < 4; i++)
  {
    inbox = (inbox << 8) | inMsg.buf[i];
  }
  CANmilliamps = inbox;
  if (candebug == 1 && debug == 1)
  {
    
    Serial.println();
    Serial.print(CANmilliamps, HEX);
    Serial.print(" | ");
  }
  if (CANmilliamps > 0x800000)
  {
    CANmilliamps -= 0x800000;
  }
  else
  {
    CANmilliamps = (0x800000 - CANmilliamps) * -1;
  }
  if ( settings.cursens == Canbus)
  {
    RawCur = CANmilliamps;
    getcurrent();
  }
  if (candebug == 1 && debug == 1)
  {
    Serial.print(CANmilliamps);
    Serial.print("mA ");
  }
}


void currentlimit()
{
  if (bmsstatus == Error)
  {
    discurrent = 0;
    chargecurrent = 0;
  }
  /*
    settings.PulseCh = 600; //Peak Charge current in 0.1A
    settings.PulseChDur = 5000; //Ms of discharge pulse derating
    settings.PulseDi = 600; //Peak Charge current in 0.1A
    settings.PulseDiDur = 5000; //Ms of discharge pulse derating
  */
  else
  {

