martiinezz/BMWI3BMS-ESP32/src/main.cpp
    ///Start at no derating///
    discurrent = settings.discurrentmax;
    chargecurrent = settings.chargecurrentmax;


    ///////All hard limits to into zeros
    if (bms.getLowTemperature() < settings.UnderTSetpoint)
    {
      //discurrent = 0; Request Daniel
      chargecurrent = 0;
    }
    if (bms.getHighTemperature() > settings.OverTSetpoint)
    {
      discurrent = 0;
      chargecurrent = 0;
    }
    if (bms.getHighCellVolt() > settings.OverVSetpoint)
    {
      chargecurrent = 0;
    }
    if (bms.getHighCellVolt() > settings.OverVSetpoint)
    {
      chargecurrent = 0;
    }
    if (bms.getLowCellVolt() < settings.UnderVSetpoint || bms.getLowCellVolt() < settings.DischVsetpoint)
    {
      discurrent = 0;
    }


    //Modifying discharge current///

    if (discurrent > 0)
    {
      //Temperature based///

      if (bms.getHighTemperature() > settings.DisTSetpoint)
      {
        discurrent = discurrent - map(bms.getHighTemperature(), settings.DisTSetpoint, settings.OverTSetpoint, 0, settings.discurrentmax);
      }
      //Voltagee based///
      if (bms.getLowCellVolt() < (settings.DischVsetpoint + settings.DisTaper))
      {
        discurrent = discurrent - map(bms.getLowCellVolt(), settings.DischVsetpoint, (settings.DischVsetpoint + settings.DisTaper), settings.discurrentmax, 0);
      }
    }

    //Modifying Charge current///
    if (chargecurrent > 0)
    {
      //Temperature based///
      if (bms.getLowTemperature() < settings.ChargeTSetpoint)
      {
        chargecurrent = chargecurrent - map(bms.getLowTemperature(), settings.UnderTSetpoint, settings.ChargeTSetpoint, settings.chargecurrentmax, 0);
        //Serial.println();
        // Serial.println("temperature derate charge current");
      }
      //Voltagee based///
      if (storagemode == 1)
      {
        if (bms.getHighCellVolt() > (settings.StoreVsetpoint - settings.ChargeHys))
        {
          chargecurrent = chargecurrent - map(bms.getHighCellVolt(), (settings.StoreVsetpoint - settings.ChargeHys), settings.StoreVsetpoint, settings.chargecurrentend, settings.chargecurrentmax);
        }
      }
      else
      {
        if (bms.getHighCellVolt() > (settings.ChargeVsetpoint - settings.ChargeHys))
        {
          chargecurrent = chargecurrent - map(bms.getHighCellVolt(), (settings.ChargeVsetpoint - settings.ChargeHys), settings.ChargeVsetpoint, 0, (settings.chargecurrentmax - settings.chargecurrentend));
          // Serial.println();
          //    Serial.println("Voltage derate charge current");
        }
      }
    }

  }
  ///No negative currents///

  if (discurrent < 0)
  {
    discurrent = 0;
  }
  if (chargecurrent < 0)
  {
    chargecurrent = 0;
  }
}


void inputdebug()
{
  Serial.println();
  Serial.print("Input: ");
  if (digitalRead(IN1))
  {
    Serial.print("1 ON  ");
  }
  else
  {
    Serial.print("1 OFF ");
  }
  if (digitalRead(IN2))
  {
    Serial.print("2 ON  ");
  }
  else
  {
    Serial.print("2 OFF ");
  }
  if (digitalRead(IN3))
  {
    Serial.print("3 ON  ");
  }
  else
  {
    Serial.print("3 OFF ");
  }
  if (digitalRead(IN4))
  {
    Serial.print("4 ON  ");
  }
  else
  {
    Serial.print("4 OFF ");
  }
  Serial.println();
}

void outputdebug()
{
  if (outputstate < 5)
  {
    digitalWrite(OUT1, HIGH);
    digitalWrite(OUT2, HIGH);
    digitalWrite(OUT3, HIGH);
    digitalWrite(OUT4, HIGH);
    ledcWrite(OUT5, 255);
    ledcWrite(OUT6, 255);
    ledcWrite(OUT7, 255);
    ledcWrite(OUT8, 255);
    outputstate ++;
  }
  else
  {
    digitalWrite(OUT1, LOW);
    digitalWrite(OUT2, LOW);
    digitalWrite(OUT3, LOW);
    digitalWrite(OUT4, LOW);
    ledcWrite(OUT5, 0);
    ledcWrite(OUT6, 0);
    ledcWrite(OUT7, 0);
    ledcWrite(OUT8, 0);
    outputstate ++;
  }
  if (outputstate > 10)
  {
    outputstate = 0;
  }
}

void balancing()
{
  //Function to control balancing command, to be found
}

void sendcommand() //Send Can Command to get data from slaves
{
  if (mescycle == 0xF)
  {
    mescycle = 0;

    if (balancetimer < millis())
    {
      balancepauze = 1;
      if (debug == 1)
      {
        Serial.println();
        Serial.println("Reset Balance Timer");
        Serial.println();
      }
      balancetimer = millis() + ((settings.balanceDuty + 60) * 1000);
    }
    else
    {
      balancepauze = 0;
    }
  }

  if (settings.CSCvariant == BmwI3)
  {
    if (nextmes == 8)
    {
      nextmes = 0;
      if (testcycle < 4)
      {
        testcycle++;
      }
    }
  }
  if (settings.CSCvariant == MiniE)
  {
    if (nextmes == 0xC)
    {
      nextmes = 0;
      if (testcycle < 4)
      {
        testcycle++;
      }
    }
  }

  msg.id  = 0x080 | (nextmes);
  msg.len = 8;
  if (balancecells == 1 && balancepauze == 0)
  {
    msg.buf[0] = lowByte((uint16_t((bms.getLowCellVolt()) * 1000) + 10));
    msg.buf[1] = highByte((uint16_t((bms.getLowCellVolt()) * 1000) + 10));
  }
  else
  {
    msg.buf[0] = 0x68;
    msg.buf[1] = 0x10;
  }
  msg.buf[2] = 0x00; //balancing bits

  if (testcycle < 3)
  {
    msg.buf[3] = 0x00;
    msg.buf[4] = 0x00;
  }
  else
  {
    msg.buf[3] = 0x50; // 0x00 request no measurements, 0x50 request voltage and temp, 0x10 request voltage measurement, 0x40 request temperature measurement.//balancing bits
    if (balancecells == 1)
    {
      msg.buf[4] = 0x08; // 0x00 request no balancing
    }
    else
    {
      msg.buf[4] = 0x00;
    }
  }
  msg.buf[5] = 0x00;
  msg.buf[6] = mescycle << 4;
  if (testcycle == 2)
  {
    msg.buf[6] = msg.buf[6] + 0x04;
  }

  msg.buf[7] = getcheck(msg, nextmes);
  //Serial.print(msg.buf[7],HEX);
  /*
    if (nextmes == 7)
    {
    Serial.println();
    for (int y = 0; y < 8; y++)
    {
      Serial.print(msg.buf[y], HEX);
      Serial.print("|");
    }
    Serial.println();
    }
  */
  delay(2);
  ESPsendCAN(msg);
  
  mescycle ++;
  nextmes ++;

  if (bms.checkstatus() == true)
  {
    resetbalancedebug();
  }
}

void resetwdog()
{
  noInterrupts(); 
  esp_task_wdt_reset();
  interrupts();
}

