martiinezz/BMWI3BMS-ESP32/src/main.cpp
void pwmcomms()
{
  int p = 0;
  p = map((currentact * 0.001), pwmcurmin, pwmcurmax, 50 , 255);
  ledcWrite(OUT7, p);
  /*
    Serial.println();
      Serial.print(p*100/255);
      Serial.print(" OUT8 ");
  */
  if (bms.getLowCellVolt() < settings.UnderVSetpoint)
  {
    ledcWrite(OUT8, 224); //12V to 10V converter 1.5V
  }
  else
  {
    p = map(SOC, 0, 100, 220, 50);
    ledcWrite(OUT8, p); //2V to 10V converter 1.5-10V
  }
  /*
      Serial.println();
      Serial.print(p*100/255);
      Serial.print(" OUT7 ");
  */
}

void dashupdate()
{
  SERIAL_CSV.write("stat.txt=");
  SERIAL_CSV.write(0x22);
  if (settings.ESSmode == 1)
  {
    switch (bmsstatus)
    {
      case (Boot):
        SERIAL_CSV.print(" Active ");
        break;
      case (Error):
        SERIAL_CSV.print(" Error ");
        break;
    }
  }
  else
  {
    switch (bmsstatus)
    {
      case (Boot):
        SERIAL_CSV.print(" Boot ");
        break;

      case (Ready):
        SERIAL_CSV.print(" Ready ");
        break;

      case (Precharge):
        SERIAL_CSV.print(" Precharge ");
        break;

      case (Drive):
        SERIAL_CSV.print(" Drive ");
        break;

      case (Charge):
        SERIAL_CSV.print(" Charge ");
        break;

      case (Error):
        SERIAL_CSV.print(" Error ");
        break;
    }
  }
  SERIAL_CSV.write(0x22);
  SERIAL_CSV.write(0xff);  // We always have to send this three lines after each command sent to the nextion display.
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.print("soc.val=");
  SERIAL_CSV.print(SOC);
  SERIAL_CSV.write(0xff);  // We always have to send this three lines after each command sent to the nextion display.
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.print("soc1.val=");
  SERIAL_CSV.print(SOC);
  SERIAL_CSV.write(0xff);  // We always have to send this three lines after each command sent to the nextion display.
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.print("current.val=");
  SERIAL_CSV.print(currentact / 100, 0);
  SERIAL_CSV.write(0xff);  // We always have to send this three lines after each command sent to the nextion display.
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.print("temp.val=");
  SERIAL_CSV.print(bms.getAvgTemperature(), 0);
  SERIAL_CSV.write(0xff);  // We always have to send this three lines after each command sent to the nextion display.
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.print("templow.val=");
  SERIAL_CSV.print(bms.getLowTemperature(), 0);
  SERIAL_CSV.write(0xff);  // We always have to send this three lines after each command sent to the nextion display.
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.print("temphigh.val=");
  SERIAL_CSV.print(bms.getHighTemperature(), 0);
  SERIAL_CSV.write(0xff);  // We always have to send this three lines after each command sent to the nextion display.
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.print("volt.val=");
  SERIAL_CSV.print(bms.getPackVoltage() * 10, 0);
  SERIAL_CSV.write(0xff);  // We always have to send this three lines after each command sent to the nextion display.
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.print("lowcell.val=");
  SERIAL_CSV.print(bms.getLowCellVolt() * 1000, 0);
  SERIAL_CSV.write(0xff);  // We always have to send this three lines after each command sent to the nextion display.
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.print("highcell.val=");
  SERIAL_CSV.print(bms.getHighCellVolt() * 1000, 0);
  SERIAL_CSV.write(0xff);  // We always have to send this three lines after each command sent to the nextion display.
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.print("firm.val=");
  SERIAL_CSV.print(firmver);
  SERIAL_CSV.write(0xff);  // We always have to send this three lines after each command sent to the nextion display.
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.print("celldelta.val=");
  SERIAL_CSV.print((bms.getHighCellVolt() - bms.getLowCellVolt()) * 1000, 0);
  SERIAL_CSV.write(0xff);  // We always have to send this three lines after each command sent to the nextion display.
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.print("cellbal.val=");
  if (balancecells == 1)
  {
    SERIAL_CSV.print(0x01);
  }
  else
  {
    SERIAL_CSV.print(0x00);
  }
  SERIAL_CSV.write(0xff);  // We always have to send this three lines after each command sent to the nextion display.
  SERIAL_CSV.write(0xff);
  SERIAL_CSV.write(0xff);
}


void chargercomms()
{
  if (accurlim > 0)
  {
    uint16_t chargerpower = (accurlim * 0.001) * ACvolt * ChargerEff * 0.1;
    int chargelim = chargerpower / (settings.ChargeVsetpoint * settings.Scells);
    if (chargelim < chargecurrent)
    {
      chargecurrent = chargelim;
      //Serial.println();
      //Serial.println("CP derate charge current");
    }
    if (CPdebug == 1)
    {
      Serial.println();
      Serial.print(" DC Power : ");
      Serial.print(chargerpower * 0.1, 0);
      Serial.print(" DC Charge : ");
      Serial.print(chargelim);
    }
  }

  if (settings.chargertype == Elcon)
  {
    msg.id  =  0x1806E5F4; //broadcast to all Elteks
    msg.len = 8;
    msg.flags.extended = 1;
    msg.buf[0] = highByte(uint16_t(settings.ChargeVsetpoint * settings.Scells * 10));
    msg.buf[1] = lowByte(uint16_t(settings.ChargeVsetpoint * settings.Scells * 10));
    msg.buf[2] = highByte(chargecurrent / ncharger);
    msg.buf[3] = lowByte(chargecurrent / ncharger);
    msg.buf[4] = 0x00;
    msg.buf[5] = 0x00;
    msg.buf[6] = 0x00;
    msg.buf[7] = 0x00;

    ESPsendCAN(msg);
    msg.flags.extended = 0;
  }

  if (settings.chargertype == Eltek)
  {
    msg.id  = 0x2FF; //broadcast to all Elteks
    msg.len = 7;
    msg.buf[0] = 0x01;
    msg.buf[1] = lowByte(1000);
    msg.buf[2] = highByte(1000);
    msg.buf[3] = lowByte(uint16_t(settings.ChargeVsetpoint * settings.Scells * 10));
    msg.buf[4] = highByte(uint16_t(settings.ChargeVsetpoint * settings.Scells * 10));
    msg.buf[5] = lowByte(chargecurrent / ncharger);
    msg.buf[6] = highByte(chargecurrent / ncharger);

    ESPsendCAN(msg);
    
